Q.1 What is Pandas, and how is it different from NumPy?

Q.2 Explain the difference between a Series and a DataFrame in Pandas.

Q.3 How can you create a DataFrame in Pandas from a dictionary?

Q.4 What is the purpose of the index in a Pandas DataFrame or Series?

Q.5 How can you add a new column to an existing DataFrame?

Q.6 Explain how you can delete a column or row from a DataFrame.

Q.7 What are the different ways to select subsets of data from a DataFrame?

Q.8 How do you handle missing data in Pandas?

Q.9 How can you group data in a DataFrame and apply aggregate functions?

Q.10 What is the difference between the apply(), map(), functions in Pandas?

Q.11 How does the merge() function in Pandas differ from the concat() function?

Q.12 What is the purpose of the pivot_table() function in Pandas?

Q.13 Explain the difference between loc[] and iloc[] in Pandas.

Q.14 How can you sort a DataFrame by its index or values?

Q.15 If you have a DataFrame with duplicate rows, how can you remove them?

Q.16 How can you check the data types of each column in a DataFrame?

Q.17 What methods can you use to get a quick statistical summary of a DataFrame?

Q.18 How can you count the number of unique values in a specific column?

Q.19 How can you identify and filter rows based on a condition in a DataFrame?

Q.20 How can you count the number of unique values in a specific column?

In [1]:
#Q1
# pandas is python library,it is used for manipulation of dataset and managing
# numpy is also python library for creating arrays and mathematical operation,where pandas is used for CRUD operation

In [2]:
#Q2
#series is data in single dimension(single column) with index values,series had 1 dim
#dataframe is data in multi-dimension(multiple column) with index values,dataframe has ndim

In [4]:
#Q3
import pandas as pd
data={"name":["gaurav","pankaj","raj"],
     "age":[20,21,22]}
df=pd.DataFrame(data)
df

     name  age
0  gaurav   20
1  pankaj   21
2     raj   22

In [6]:
#Q4
# index behaves like a primary key in dataset, In case of loc we extract dataframe using index values
# indexing can be userdefined,it is neccesary for series or dataframe to have index

In [9]:
# Q5
df["address"]=["nagaur","jaipur","jaipur"]
df

     name  age address
0  gaurav   20  nagaur
1  pankaj   21  jaipur
2     raj   22  jaipur

In [31]:
#Q6
#column drop
df.drop(columns=['address'],axis=1)

     name  age
0  gaurav   20
1  pankaj   21
2     raj   22

In [11]:
#row drop
df.drop(index=2,axis=0)

     name  age address
0  gaurav   20  nagaur
1  pankaj   21  jaipur

In [12]:
#Q7
#1.Dataframe.loc[row label,column label]
#2.Dataframe.iloc[range of row,range of column]
#3.pd.pivot_table(index,columns,values,aggrfun)
#4.using slicing and condition based slicing :- data[column name]-->columns,data[range rows],data[[column name]]-->multiple columns
#5.df.where()

In [33]:
#Q8
df.isnull().sum()
df.dropna()

     name  age address
0  gaurav   20  nagaur
1  pankaj   21  jaipur
2     raj   22  jaipur

In [14]:
#Q9
df.groupby("name")["age"].sum()

name
gaurav    20
pankaj    21
raj       22
Name: age, dtype: int64

In [15]:
#Q10
#apply--> is used to apply the function on dataframe --->df.apply(func)
#map --->is used to change/replace the data with given mapping value-->df.map(dict_values)

In [16]:
#Q11
# merge is works as join operation on data,merge operation is horizonatal on common column
# it has all types of join-->inner,outer,full,cross
# whereas concat will add two dataframe horizonatally

In [17]:
#Q12
# pivot table is used for finding relation between index values and columns values by creating values
# it is also like a dataframe

In [34]:
#Q13
#1.Dataframe.loc[row label,column label]-->label based slicing
#2.Dataframe.iloc[range of row,range of column]-->index based slicing

In [20]:
#Q14
df.sort_values(by=['age'])
df.sort_index()

     name  age address
0  gaurav   20  nagaur
1  pankaj   21  jaipur
2     raj   22  jaipur

In [22]:
#Q15
df.drop_duplicates()

     name  age address
0  gaurav   20  nagaur
1  pankaj   21  jaipur
2     raj   22  jaipur

In [24]:
#Q16
df.dtypes

name       object
age         int64
address    object
dtype: object

In [25]:
#Q17
df.describe()

        age
count   3.0
mean   21.0
std     1.0
min    20.0
25%    20.5
50%    21.0
75%    21.5
max    22.0

In [27]:
#Q18
df['name'].nunique()

3

In [32]:
#19
#df.where(condition).dropna()
#df[df[column] condtion logical operator df[column] condition...]

In [ ]:
#20
df['name'].nunique()